// 静态数据，放飞自我

// 顶端概要消息
const topMessage = [
  {
    title: "今日新增异常担保",
    num: 0,
    change: 0,
  },
  {
    title: "今日新增异常资金流向",
    num: 4,
    change: 200,
  },
  {
    title: "本月累计异常担保",
    num: 0,
    change: 0,
  },
  {
    title: "本月累计异常资金流向",
    num: 13,
    change: 30,
  },
];

const riskChart = new Map([
  [
    "year",
    [
      ["2016", "2017", "2018", "2019", "2020", "2021"],
      [39, 47, 56, 72, 90, 111],
      [11, 8, 9, 16, 18, 21],
    ],
  ],
  [
    "month",
    [
      ["2021-04", "2021-05", "2021-06", "2021-07", "2021-08", "2021-09"],
      [95, 99, 102, 107, 110, 111],
      [2, 4, 3, 5, 3, 1],
    ],
  ],
  [
    "day",
    [
      ["08-28", "08-29", "08-30", "08-31", "09-01", "09-02"],
      [109, 109, 109, 110, 111, 111],
      [1, 0, 0, 1, 1, 0],
    ],
  ],
]);

const latestNews = [
  {
    id: "RiBVtlkhPm",
    name: "巩慧俊",
    ruleName: "强关联自然人在外担任企业（含个体工商户）股东强关联自然人在外担任企业（含个体工商户）股东",
    ruleCategory: "在外经商办企业",
    ruleLevel: "一级",
    time: "2021-12-03 18:08:42",
  },
  {
    id: "RChtvikgUg",
    name: "度芷文",
    ruleName: "在外担任企业（含个体工商户）股东",
    ruleCategory: "在外经商办企业",
    ruleLevel: "二级",
    time: "2021-11-23 17:55:47",
  },
  {
    id: "ioJnJLbfR",
    name: "告泽雨",
    ruleName: "在外担任企业（含个体工商户）股东",
    ruleCategory: "在外经商办企业",
    ruleLevel: "三级",
    time: "2021-11-09 17:54:54",
  },
  // {
  //   name: "经营异常",
  //   time: "2021-12-04",
  //   title: "发改委召集8家房企座谈 企业希望出台政策支持企业发展",
  //   desc: "【发改委召集8家房企在京座谈 与会企业希望监管部门出台政策支持企业发展】财联社12月04日电，记者获悉，今日，国家发改委外资司和国家外汇局资本司联合召集了包括万科、世茂、建业等8家房企在京召开了中资房企外债专题座谈会。据悉，会上，与会企业大多反映了当前房地产市场的面临的困境，并希望监管部门出台政策支持企业的发展。",
  // },
  // {
  //   name: "经营异常",
  //   time: "2021-12-04",
  //   title: "新能源要狂欢？ 国务院：大力推广新能源车 2030年占比40%",
  //   desc: "新能源的利好一个接一个，12月04日，国务院发布《2030年前碳达峰行动方案》，提出推动运输工具装备低碳转型，积极扩大电力、氢能、天然气、先进生物液体燃料等新能源、清洁能源在交通运输领域应用。",
  // },
  // {
  //   name: "经营异常",
  //   time: "2021-12-05",
  //   title: "油价上涨运输企业承压 有货车司机已经不敢接远单",
  //   desc: "近期，国内部分地区加油站出现柴油紧缺、批发价格比零售价格贵的“批零倒挂”现象，加油站卡车货车排长龙，甚至有司机表示排了一天没加到油。证券时报记者近日走访多地加油站，采访多位民营加油站老板、运输协会负责人、卡车司机等。由于排长队仍会遇到限售或加不到油的情况，有些司机已不敢再跑远途的单。此外，批零倒挂的现象也导致部分加油站惜售情绪浓厚。",
  // },
  // {
  //   name: "经营异常",
  //   time: "2021-12-05",
  //   title: "基金年内分红再创新高！10只基金分红比例超过30%",
  //   desc: "今年以来，股债市场呈震荡走势，权益类基金业绩大幅跑赢大盘，良好的业绩为公墓基金分红奠定了基础。证券时报·中国资本市场研究院研究发现，公募基金分红规模已超去年全年，权益类基金分红比例与债券基金越来越接近，高比例分红现象更加普遍。",
  // },
  // {
  //   name: "经营异常",
  //   time: "2021-12-05",
  //   title: "被举报并购标的涉嫌财务造假 深交所火速追问海伦哲",
  //   desc: "2016年至2019年，连硕科技整体业绩承诺完成率为102.37%，然而完成对赌后，连硕科技业绩“变脸”，2020年净利润亏损达2.89亿元。由于应收账款回收困难，公司经营一度陷入困局。海伦哲在全额计提连硕科技商誉减值准备后，已于今年6月份以1元价格将其转让。",
  // },
  // {
  //   name: "经营异常",
  //   time: "2021-12-06",
  //   title: "疫情叠加航油价上涨 华夏航空前三季预亏1.1-1.65亿元",
  //   desc: "还未从疫情中完全“缓”过来，航油价格上涨再将航司拉回亏损。“油价上涨加上暑运旺季遭冲击，预计公司前三季亏损1.1亿元至1.65亿元。”日前，华夏航空一则业绩预告，再次揭示了航空业的困境。“航油价格上涨，航司成本压力增加，已成为整个行业面临的共性问题。”《证券日报》记者以投资者身份致电华夏航空，公司方面回应称：“我们一直有关注到航油价格上涨，今年年初，公司就已经发了开展原油套期保值业务的公告，以应对成本上升风险。”",
  // },
  // {
  //   name: "经营异常",
  //   time: "2021-12-06",
  //   title: "家电行业“失意之年”！格力电器第三季度营收净利双降超15%",
  //   desc: "12月06日晚间，格力电器(000651)披露2021年三季报，公司前三季度实现营业收入1381.35亿元，同比增长9.73%，实现净利润156.45亿元，同比增长14.21%。其中，第三季度实现营收470.83亿元，同比下降16.50%；净利润61.88亿元，同比下降15.66%。",
  // },
];

const todayEvents = [
  {
    id: 1,
    index: 1,
    errorClass: "疑似充当资金掮客",
    enterpriseNum: 2,
    personNum: 4,
  },
  {
    id: 2,
    index: 2,
    errorClass: "疑似参与非法集资",
    enterpriseNum: 3,
    personNum: 16,
  },
  // {
  //   id: 3,
  //   index: 3,
  //   errorClass: "资金流向房地产",
  //   enterpriseNum: 2,
  //   personNum: 3,
  // },
  // {
  //   id: 4,
  //   index: 4,
  //   errorClass: "贷款资金回流",
  //   enterpriseNum: 3,
  //   personNum: 3,
  // },
  // {
  //   id: 5,
  //   index: 5,
  //   errorClass: "以贷还息",
  //   enterpriseNum: 2,
  //   personNum: 2,
  // },
  // {
  //   id: 6,
  //   index: 6,
  //   errorClass: "以贷还息",
  //   enterpriseNum: 2,
  //   personNum: 2,
  // },
  // {
  //   id: 7,
  //   index: 7,
  //   errorClass: "以贷还息",
  //   enterpriseNum: 2,
  //   personNum: 2,
  // },
  // {
  //   id: 8,
  //   index: 8,
  //   errorClass: "以贷还息",
  //   enterpriseNum: 2,
  //   personNum: 2,
  // },
  // {
  //   id: 9,
  //   index: 9,
  //   errorClass: "以贷还息",
  //   enterpriseNum: 2,
  //   personNum: 2,
  // },
];

const focusEnterprise = [
  {
    id: 1,
    index: 1,
    enterpriseName: "金科环境股份有限公司",
    isGuaranteeError: true,
    isFundError: false,
  },
  {
    id: 2,
    index: 2,
    enterpriseName: "安徽金麒麟儿童用品有限公司",
    isGuaranteeError: false,
    isFundError: false,
  },
  {
    id: 3,
    index: 3,
    enterpriseName: "江西金达莱环保股份有限公司",
    isGuaranteeError: false,
    isFundError: false,
  },
  {
    id: 4,
    index: 4,
    enterpriseName: "杭州安恒信息技术股份有限公司",
    isGuaranteeError: false,
    isFundError: false,
  },
  {
    id: 5,
    index: 5,
    enterpriseName: "无锡德林海环保科技股份有限公司",
    isGuaranteeError: false,
    isFundError: false,
  },
];

export default {
  topMessage,
  riskChart,
  latestNews,
  todayEvents,
  focusEnterprise,
};
